app/controllers/comments_controller.rb

	def create
		@quote = Quote.find(params[:quote_id])
		@comment = @quote.comments.create(comment_params)
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "quote_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "ja"], ["body", "ksk"], ["quote_id", 7], ["created_at", "2018-10-11 11:44:19.282008"], ["updated_at", "2018-10-11 11:44:19.282008"]]

	def destroy
		@quote = Quote.find(params[:quote_id])
		@comment = @quote.comments.find(params[:id])
		@comment.destroy
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."quote_id" = ? AND "comments"."id" = ? LIMIT ?  [["quote_id", 5], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]