app/controllers/quotes_controller.rb

  def edit
  	@quote = Quote.find(params[:id])
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
  	 @quote = Quote.new(quotes_params)

    if @quote.save
---
INSERT INTO "quotes" ("Enter_your_quote", "Written_by", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Enter_your_quote", "yioowj a modoofi"], ["Written_by", "ghfeu"], ["created_at", "2018-10-11 08:11:12.003361"], ["updated_at", "2018-10-11 08:11:12.003361"]]

  def update
  	@quote = Quote.find(params[:id])

  	if @quote.update(quotes_params)
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "quotes" SET "Enter_your_quote" = ?, "updated_at" = ? WHERE "quotes"."id" = ?  [["Enter_your_quote", "Hope good...and "], ["updated_at", "2018-10-11 17:02:56.265459"], ["id", 14]]

  def destroy
  	@quote = Quote.find(params[:id])

  	 @quote.destroy
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "quotes" WHERE "quotes"."id" = ?  [["id", 11]]