app/controllers/quotes_controller.rb

DELETE FROM "quotes" WHERE "quotes"."id" = ?  [["id", 23]]
---
  def destroy
  	@quote = Quote.find(params[:id])

    respond_to do |format|
  	 if @quote.destroy